"""Задача #3 – пироженки и коробочки"""


def print_pack_report(amount: int) -> None:
    """
        Выводит отчёт о расфасовке на 3 или на 5 пироженных для чисел от amount до 1

        Args:
            amount (int): Начальное количество товара (верхняя граница диапазона отсчета)

        Returns:
            None: Функция ничего не возвращает, только выводит отчёт в консоль

        Example:
            >>> print_pack_report(5)
            5 - расфасуем по 5
            4 - не заказываем!
            3 - расфасуем по 3
            2 - не заказываем!
            1 - не заказываем!
    """

    for n in range(amount, 0, -1):

        is_3 = n % 3 == 0
        is_5 = n % 5 == 0

        if is_3 and is_5:
            print(f"{n} - расфасуем по 3 или по 5")
        elif is_3:
            print(f"{n} - расфасуем по 3")
        elif is_5:
            print(f"{n} - расфасуем по 5")
        else:
            print(f"{n} - не заказываем!")

print_pack_report(30)

